RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/hc32_ll_driver/src/hc32_ll_rtc.c
/**
 *******************************************************************************
 * @file  hc32_ll_rtc.c
 * @brief This file provides firmware functions to manage the Real-Time
 *        Clock(RTC).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-06-30       CDT             First version
   2023-06-30       CDT             Add PWC_FPRC.FPRCB1 assert in RTC_Init and RTC_SetClockSrc functions
                                    Delete intrusion function
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2023, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_rtc.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_RTC RTC
 * @brief Real-Time Clock Driver Library
 * @{
 */

#if (LL_RTC_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup RTC_Local_Macros RTC Local Macros
 * @{
 */

/* RTC CR2 & TPSR flag mask */
#define RTC_CR2_FLAG_MASK                   (RTC_CR2_ALMF | RTC_CR2_PRDF)

/* RTC software reset timeout(ms) */
#define RTC_SW_RST_TIMEOUT                  (100UL)
/* RTC mode switch timeout(ms) */
#define RTC_MD_SWITCH_TIMEOUT               (100UL)

/**
 * @defgroup RTC_Check_Parameters_Validity RTC Check Parameters Validity
 * @{
 */
#define IS_RTC_DATA_FMT(x)                                                     \
(   ((x) == RTC_DATA_FMT_DEC)                       ||                         \
    ((x) == RTC_DATA_FMT_BCD))

#define IS_RTC_CLK_SRC(x)                                                      \
(   ((x) == RTC_CLK_SRC_XTAL32)                     ||                         \
    ((x) == RTC_CLK_SRC_LRC)                        ||                         \
    ((x) == RTC_CLK_SRC_EXTCLK)                     ||                         \
    ((x) == RTC_CLK_SRC_EXTCLK_1)                   ||                         \
    ((x) == RTC_CLK_SRC_XTAL_DIV))

#define IS_RTC_HOUR_FMT(x)                                                     \
(   ((x) == RTC_HOUR_FMT_12H)                       ||                         \
    ((x) == RTC_HOUR_FMT_24H))

#define IS_RTC_INT_PERIOD(x)                                                   \
(   ((x) == RTC_INT_PERIOD_INVD)                    ||                         \
    ((x) == RTC_INT_PERIOD_PER_HALF_SEC)            ||                         \
    ((x) == RTC_INT_PERIOD_PER_SEC)                 ||                         \
    ((x) == RTC_INT_PERIOD_PER_MINUTE)              ||                         \
    ((x) == RTC_INT_PERIOD_PER_HOUR)                ||                         \
    ((x) == RTC_INT_PERIOD_PER_DAY)                 ||                         \
    ((x) == RTC_INT_PERIOD_PER_MONTH))

#define IS_RTC_CLK_COMPEN(x)                                                   \
(   ((x) == RTC_CLK_COMPEN_DISABLE)                 ||                         \
    ((x) == RTC_CLK_COMPEN_ENABLE))

#define IS_RTC_CLK_COMPEN_MD(x)                                                \
(   ((x) == RTC_CLK_COMPEN_MD_DISTRIBUTED)          ||                         \
    ((x) == RTC_CLK_COMPEN_MD_UNIFORM))

#define IS_RTC_HOUR_12H_AM_PM(x)                                               \
(   ((x) == RTC_HOUR_12H_AM)                        ||                         \
    ((x) == RTC_HOUR_12H_PM))

#define IS_RTC_GET_FLAG(x)                                                     \
(   ((x) != 0U)                                     &&                         \
    (((x) | RTC_FLAG_ALL) == RTC_FLAG_ALL))

#define IS_RTC_CLR_FLAG(x)                                                     \
(   ((x) != 0U)                                     &&                         \
    (((x) | RTC_FLAG_CLR_ALL) == RTC_FLAG_CLR_ALL))

#define IS_RTC_INT(x)                                                          \
(   ((x) != 0U)                                     &&                         \
    (((x) | RTC_INT_ALL) == RTC_INT_ALL))

#define IS_RTC_YEAR(x)                              ((x) <= 99U)

#define IS_RTC_MONTH(x)                             (((x) >= 1U) && ((x) <= 12U))

#define IS_RTC_DAY(x)                               (((x) >= 1U) && ((x) <= 31U))

#define IS_RTC_HOUR_12H(x)                          (((x) >= 1U) && ((x) <= 12U))

#define IS_RTC_HOUR_24H(x)                          ((x) <= 23U)

#define IS_RTC_MINUTE(x)                            ((x) <= 59U)

#define IS_RTC_SEC(x)                               ((x) <= 59U)

#define IS_RTC_WEEKDAY(x)                           ((x) <= 6U)

#define IS_RTC_ALARM_WEEKDAY(x)                     (((x) >= 0x01U) && ((x) <= 0x7FU))

#define IS_RTC_COMPEN_VALUE(x)                      ((x) <= 0x1FFU)

#define IS_RTC_PWC_UNLOCKED()                       ((CM_PWC->FPRC & PWC_FPRC_FPRCB1) == PWC_FPRC_FPRCB1)
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

