RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/hc32_ll_driver/src/hc32_ll_rtc.c
/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup RTC_Global_Functions RTC Global Functions
 * @{
 */

/**
 * @brief  De-Initialize RTC.
 * @param  None
 * @retval int32_t:
 *           - LL_OK: De-Initialize success
 *           - LL_ERR_TIMEOUT: De-Initialize timeout
 */
int32_t RTC_DeInit(void)
{
    __IO uint32_t u32Count;
    int32_t i32Ret = LL_OK;

    WRITE_REG32(bCM_RTC->CR0_b.RESET, RESET);
    /* Waiting for normal count status or end of RTC software reset */
    u32Count = RTC_SW_RST_TIMEOUT * (HCLK_VALUE / 20000UL);
    while (0UL != READ_REG32(bCM_RTC->CR0_b.RESET)) {
        if (0UL == u32Count) {
            i32Ret = LL_ERR_TIMEOUT;
            break;
        }
        u32Count--;
    }

    if (LL_OK == i32Ret) {
        /* Reset all RTC registers */
        WRITE_REG32(bCM_RTC->CR0_b.RESET, SET);
        /* Waiting for RTC software reset to complete */
        u32Count = RTC_SW_RST_TIMEOUT * (HCLK_VALUE / 20000UL);
        while (0UL != READ_REG32(bCM_RTC->CR0_b.RESET)) {
            if (0UL == u32Count) {
                i32Ret = LL_ERR_TIMEOUT;
                break;
            }
            u32Count--;
        }
    }

    return i32Ret;
}

/**
 * @brief  Initialize RTC.
 * @param  [in] pstcRtcInit             Pointer to a @ref stc_rtc_init_t structure
 * @retval int32_t:
 *           - LL_OK: Initialize success
 *           - LL_ERR_INVD_PARAM: Invalid parameter
 */
int32_t RTC_Init(const stc_rtc_init_t *pstcRtcInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcRtcInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_CLK_SRC(pstcRtcInit->u8ClockSrc));
        DDL_ASSERT(IS_RTC_HOUR_FMT(pstcRtcInit->u8HourFormat));
        DDL_ASSERT(IS_RTC_INT_PERIOD(pstcRtcInit->u8IntPeriod));
        DDL_ASSERT(IS_RTC_CLK_COMPEN(pstcRtcInit->u8ClockCompen));
        DDL_ASSERT(IS_RTC_COMPEN_VALUE(pstcRtcInit->u16CompenValue));
        DDL_ASSERT(IS_RTC_CLK_COMPEN_MD(pstcRtcInit->u8CompenMode));
        DDL_ASSERT(IS_RTC_PWC_UNLOCKED());

        /* RTC CR3 Configuration */
        MODIFY_REG8(CM_RTC->CR3, (RTC_CR3_LRCEN | RTC_CR3_RCKSEL), pstcRtcInit->u8ClockSrc & (RTC_CR3_LRCEN | RTC_CR3_RCKSEL));
        MODIFY_REG8(CM_PWC->PWRC6, PWC_PWRC6_RTCCKSEL, pstcRtcInit->u8ClockSrc & PWC_PWRC6_RTCCKSEL);
        /* RTC CR1 Configuration */
        MODIFY_REG8(CM_RTC->CR1, (RTC_CR1_PRDS | RTC_CR1_AMPM | RTC_CR1_ONEHZSEL),
                    (pstcRtcInit->u8IntPeriod | pstcRtcInit->u8HourFormat | pstcRtcInit->u8CompenMode));
        /* RTC Compensation Configuration */
        MODIFY_REG8(CM_RTC->ERRCRH, (RTC_ERRCRH_COMPEN | RTC_ERRCRH_COMP8),
                    (pstcRtcInit->u8ClockCompen | (uint8_t)((pstcRtcInit->u16CompenValue >> 8U) & 0x01U)));
        WRITE_REG8(CM_RTC->ERRCRL, (uint8_t)(pstcRtcInit->u16CompenValue & 0xFFU));
    }

    return i32Ret;
}

/**
 * @brief  Fills each stc_rtc_init_t member with default value.
 * @param  [out] pstcRtcInit            Pointer to a @ref stc_rtc_init_t structure
 * @retval int32_t:
 *           - LL_OK: stc_rtc_init_t member initialize success
 *           - LL_ERR_INVD_PARAM: Invalid parameter
 */
int32_t RTC_StructInit(stc_rtc_init_t *pstcRtcInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcRtcInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        pstcRtcInit->u8ClockSrc     = RTC_CLK_SRC_LRC;
        pstcRtcInit->u8HourFormat   = RTC_HOUR_FMT_24H;
        pstcRtcInit->u8IntPeriod    = RTC_INT_PERIOD_INVD;
        pstcRtcInit->u8ClockCompen  = RTC_CLK_COMPEN_DISABLE;
        pstcRtcInit->u8CompenMode   = RTC_CLK_COMPEN_MD_DISTRIBUTED;
        pstcRtcInit->u16CompenValue = 0U;
    }

    return i32Ret;
}

/**
 * @brief  Enter RTC read/write mode.
 * @param  None
 * @retval int32_t:
 *           - LL_OK: Enter mode success
 *           - LL_ERR_TIMEOUT: Enter mode timeout
 */
int32_t RTC_EnterRwMode(void)
{
    __IO uint32_t u32Count;
    int32_t i32Ret = LL_OK;

    /* Mode switch when RTC is running */
    if (0UL != READ_REG32(bCM_RTC->CR1_b.START)) {
        if (1UL != READ_REG32(bCM_RTC->CR2_b.RWEN)) {
            SET_REG8_BIT(CM_RTC->CR2, RTC_CR2_RWREQ | RTC_CR2_FLAG_MASK);
            /* Waiting for RWEN bit set */
            u32Count = RTC_MD_SWITCH_TIMEOUT * (HCLK_VALUE / 20000UL);
            while (1UL != READ_REG32(bCM_RTC->CR2_b.RWEN)) {
                if (0UL == u32Count) {
                    i32Ret = LL_ERR_TIMEOUT;
                    break;
                }
                u32Count--;
            }
        }
    }

    return i32Ret;
}

/**
 * @brief  Exit RTC read/write mode.
 * @param  None
 * @retval int32_t:
 *           - LL_OK: Exit mode success
 *           - LL_ERR_TIMEOUT: Exit mode timeout
 */
int32_t RTC_ExitRwMode(void)
{
    __IO uint32_t u32Count;
    int32_t i32Ret = LL_OK;

    /* Mode switch when RTC is running */
    if (0UL != READ_REG32(bCM_RTC->CR1_b.START)) {
        if (0UL != READ_REG32(bCM_RTC->CR2_b.RWEN)) {
            MODIFY_REG8(CM_RTC->CR2, (RTC_CR2_RWREQ | RTC_CR2_FLAG_MASK), ~RTC_CR2_RWREQ);
            /* Waiting for RWEN bit reset */
            u32Count = RTC_MD_SWITCH_TIMEOUT * (HCLK_VALUE / 20000UL);
            while (0UL != READ_REG32(bCM_RTC->CR2_b.RWEN)) {
                if (0UL == u32Count) {
                    i32Ret = LL_ERR_TIMEOUT;
                    break;
                }
                u32Count--;
            }
        }
    }

    return i32Ret;
}

/**
 * @brief  Confirm the condition for RTC to enter low power mode.
 * @param  None
 * @retval int32_t:
 *           - LL_OK: Can enter low power mode
 *           - LL_ERR_TIMEOUT: Can't enter low power mode
 */
int32_t RTC_ConfirmLPMCond(void)
{
    __IO uint32_t u32Count;
    int32_t i32Ret = LL_OK;

    /* Check RTC work status */
    if (0UL != READ_REG32(bCM_RTC->CR1_b.START)) {
        SET_REG8_BIT(CM_RTC->CR2, RTC_CR2_RWREQ | RTC_CR2_FLAG_MASK);
        /* Waiting for RTC RWEN bit set */
        u32Count = RTC_MD_SWITCH_TIMEOUT * (HCLK_VALUE / 20000UL);
        while (1UL != READ_REG32(bCM_RTC->CR2_b.RWEN)) {
            if (0UL == u32Count) {
                i32Ret = LL_ERR_TIMEOUT;
                break;
            }
            u32Count--;
        }

        if (LL_OK == i32Ret) {
            MODIFY_REG8(CM_RTC->CR2, (RTC_CR2_RWREQ | RTC_CR2_FLAG_MASK), ~RTC_CR2_RWREQ);
            /* Waiting for RTC RWEN bit reset */
            u32Count = RTC_MD_SWITCH_TIMEOUT * (HCLK_VALUE / 20000UL);
            while (0UL != READ_REG32(bCM_RTC->CR2_b.RWEN)) {
                if (0UL == u32Count) {
                    i32Ret = LL_ERR_TIMEOUT;
                    break;
                }
                u32Count--;
            }
        }
    }

    return i32Ret;
}

/**
 * @brief  Set the RTC interrupt period.
 * @param  [in] u8Period                Specifies the interrupt period.
 *         This parameter can be one of the following values:
 *           @arg RTC_INT_PERIOD_INVD:          Period interrupt invalid
 *           @arg RTC_INT_PERIOD_PER_HALF_SEC:  Interrupt per half second
 *           @arg RTC_INT_PERIOD_PER_SEC:       Interrupt per second
 *           @arg RTC_INT_PERIOD_PER_MINUTE:    Interrupt per minute
 *           @arg RTC_INT_PERIOD_PER_HOUR:      Interrupt per hour
 *           @arg RTC_INT_PERIOD_PER_DAY:       Interrupt per day
 *           @arg RTC_INT_PERIOD_PER_MONTH:     Interrupt per month
 * @retval None
 */
void RTC_SetIntPeriod(uint8_t u8Period)
{
    uint32_t u32RtcSta;
    uint32_t u32IntSta;

    /* Check parameters */
    DDL_ASSERT(IS_RTC_INT_PERIOD(u8Period));

