RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/hc32_ll_driver/src/hc32_ll_rtc.c
    u32RtcSta = READ_REG32(bCM_RTC->CR1_b.START);
    u32IntSta = READ_REG32(bCM_RTC->CR2_b.PRDIE);
    /* Disable period interrupt when START=1 and clear period flag after write */
    if ((0UL != u32IntSta) && (0UL != u32RtcSta)) {
        MODIFY_REG8(CM_RTC->CR2, (RTC_CR2_PRDIE | RTC_CR2_FLAG_MASK), ~RTC_CR2_PRDIE);
    }

    /* RTC CR1 Configuration */
    MODIFY_REG8(CM_RTC->CR1, RTC_CR1_PRDS, u8Period);
    MODIFY_REG8(CM_RTC->CR2, RTC_CR2_FLAG_MASK, ~RTC_CR2_PRDF);

    if ((0UL != u32IntSta) && (0UL != u32RtcSta)) {
        SET_REG8_BIT(CM_RTC->CR2, RTC_CR2_PRDIE | RTC_CR2_FLAG_MASK);
    }
}

/**
 * @brief  Set the RTC clock source.
 * @param  [in] u8Src                   Specifies the clock source.
 *         This parameter can be one of the following values:
 *           @arg @ref RTC_Clock_Source
 * @retval None
 */
void RTC_SetClockSrc(uint8_t u8Src)
{
    /* Check parameters */
    DDL_ASSERT(IS_RTC_CLK_SRC(u8Src));
    DDL_ASSERT(IS_RTC_PWC_UNLOCKED());

    MODIFY_REG8(CM_RTC->CR3, (RTC_CR3_LRCEN | RTC_CR3_RCKSEL), u8Src & (RTC_CR3_LRCEN | RTC_CR3_RCKSEL));
    MODIFY_REG8(CM_PWC->PWRC6, PWC_PWRC6_RTCCKSEL, u8Src & PWC_PWRC6_RTCCKSEL);
}

/**
 * @brief  Set RTC clock compensation value.
 * @param  [in] u16Value                Specifies the clock compensation value of RTC.
 *           @arg This parameter can be a number between Min_Data = 0 and Max_Data = 0x1FF.
 * @retval None
 */
void RTC_SetClockCompenValue(uint16_t u16Value)
{
    /* Check parameters */
    DDL_ASSERT(IS_RTC_COMPEN_VALUE(u16Value));

    WRITE_REG32(bCM_RTC->ERRCRH_b.COMP8, ((uint32_t)u16Value >> 8U) & 0x01U);
    WRITE_REG8(CM_RTC->ERRCRL, (uint8_t)(u16Value & 0x00FFU));
}

/**
 * @brief  Get RTC counter status.
 * @param  None
 * @retval An @ref en_functional_state_t enumeration value.
 *           - ENABLE: RTC counter started
 *           - DISABLE: RTC counter stopped
 */
en_functional_state_t RTC_GetCounterState(void)
{
    en_functional_state_t enState = DISABLE;

    if (0UL != READ_REG32(bCM_RTC->CR1_b.START)) {
        enState = ENABLE;
    }

    return enState;
}

/**
 * @brief  Enable or disable RTC count.
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void RTC_Cmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WRITE_REG32(bCM_RTC->CR1_b.START, enNewState);
}

/**
 * @brief  Enable or disable RTC LRC function.
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void RTC_LrcCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WRITE_REG32(bCM_RTC->CR3_b.LRCEN, enNewState);
}

/**
 * @brief  Enable or disable RTC 1HZ output.
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void RTC_OneHzOutputCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WRITE_REG32(bCM_RTC->CR1_b.ONEHZOE, enNewState);
}

/**
 * @brief  Enable or disable clock compensation.
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void RTC_ClockCompenCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WRITE_REG32(bCM_RTC->ERRCRH_b.COMPEN, enNewState);
}

/**
 * @brief  Set RTC current date.
 * @param  [in] u8Format                Specifies the format of the entered parameters.
 *         This parameter can be one of the following values:
 *           @arg RTC_DATA_FMT_DEC:     Decimal data format
 *           @arg RTC_DATA_FMT_BCD:     BCD data format
 * @param  [in] pstcRtcDate             Pointer to a @ref stc_rtc_date_t structure
 * @retval int32_t:
 *           - LL_OK: Set date success
 *           - LL_ERR: Set date failed
 *           - LL_ERR_INVD_PARAM: Invalid parameter
 */
int32_t RTC_SetDate(uint8_t u8Format, stc_rtc_date_t *pstcRtcDate)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcRtcDate) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_DATA_FMT(u8Format));
        if (RTC_DATA_FMT_DEC != u8Format) {
            DDL_ASSERT(IS_RTC_YEAR(RTC_BCD2DEC(pstcRtcDate->u8Year)));
            DDL_ASSERT(IS_RTC_MONTH(RTC_BCD2DEC(pstcRtcDate->u8Month)));
            DDL_ASSERT(IS_RTC_DAY(RTC_BCD2DEC(pstcRtcDate->u8Day)));
        } else {
            DDL_ASSERT(IS_RTC_YEAR(pstcRtcDate->u8Year));
            DDL_ASSERT(IS_RTC_MONTH(pstcRtcDate->u8Month));
            DDL_ASSERT(IS_RTC_DAY(pstcRtcDate->u8Day));
        }
        DDL_ASSERT(IS_RTC_WEEKDAY(pstcRtcDate->u8Weekday));

        /* Enter read/write mode */
        if (LL_OK != RTC_EnterRwMode()) {
            i32Ret = LL_ERR;
        } else {
            if (RTC_DATA_FMT_DEC == u8Format) {
                pstcRtcDate->u8Year  = RTC_DEC2BCD(pstcRtcDate->u8Year);
                pstcRtcDate->u8Month = RTC_DEC2BCD(pstcRtcDate->u8Month);
                pstcRtcDate->u8Day   = RTC_DEC2BCD(pstcRtcDate->u8Day);
            }

            WRITE_REG8(CM_RTC->YEAR, pstcRtcDate->u8Year);
            WRITE_REG8(CM_RTC->MON,  pstcRtcDate->u8Month);
            WRITE_REG8(CM_RTC->DAY,  pstcRtcDate->u8Day);
            WRITE_REG8(CM_RTC->WEEK, pstcRtcDate->u8Weekday);

            /* Exit read/write mode */
            if (LL_OK != RTC_ExitRwMode()) {
                i32Ret = LL_ERR;
            }
        }
    }

    return i32Ret;
}

/**
 * @brief  Get RTC current date.
 * @param  [in] u8Format                Specifies the format of the returned parameters.
 *         This parameter can be one of the following values:
 *           @arg RTC_DATA_FMT_DEC:     Decimal data format
 *           @arg RTC_DATA_FMT_BCD:     BCD data format
 * @param  [out] pstcRtcDate            Pointer to a @ref stc_rtc_date_t structure
 * @retval int32_t:
 *           - LL_OK: Get date success
 *           - LL_ERR: Get date failed
 *           - LL_ERR_INVD_PARAM: Invalid parameter
 */
int32_t RTC_GetDate(uint8_t u8Format, stc_rtc_date_t *pstcRtcDate)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcRtcDate) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_DATA_FMT(u8Format));
        /* Enter read/write mode */
        if (LL_OK != RTC_EnterRwMode()) {
            i32Ret = LL_ERR;
        } else {
            /* Get RTC date registers */
            pstcRtcDate->u8Year    = READ_REG8(CM_RTC->YEAR);
            pstcRtcDate->u8Month   = READ_REG8(CM_RTC->MON);
            pstcRtcDate->u8Day     = READ_REG8(CM_RTC->DAY);
            pstcRtcDate->u8Weekday = READ_REG8(CM_RTC->WEEK);

            /* Check decimal format*/
            if (RTC_DATA_FMT_DEC == u8Format) {
                pstcRtcDate->u8Year  = RTC_BCD2DEC(pstcRtcDate->u8Year);
                pstcRtcDate->u8Month = RTC_BCD2DEC(pstcRtcDate->u8Month);
                pstcRtcDate->u8Day   = RTC_BCD2DEC(pstcRtcDate->u8Day);
            }

