RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/hc32_ll_driver/src/hc32_ll_rtc.c
        /* Configure alarm registers */
        if (RTC_DATA_FMT_DEC == u8Format) {
            pstcRtcAlarm->u8AlarmHour   = RTC_DEC2BCD(pstcRtcAlarm->u8AlarmHour);
            pstcRtcAlarm->u8AlarmMinute = RTC_DEC2BCD(pstcRtcAlarm->u8AlarmMinute);
        }
        if ((RTC_HOUR_FMT_12H == READ_REG32(bCM_RTC->CR1_b.AMPM)) &&
            (RTC_HOUR_12H_PM == pstcRtcAlarm->u8AlarmAmPm)) {
            SET_REG8_BIT(pstcRtcAlarm->u8AlarmHour, RTC_HOUR_12H_PM);
        }

        WRITE_REG8(CM_RTC->ALMHOUR, pstcRtcAlarm->u8AlarmHour);
        WRITE_REG8(CM_RTC->ALMMIN,  pstcRtcAlarm->u8AlarmMinute);
        WRITE_REG8(CM_RTC->ALMWEEK, pstcRtcAlarm->u8AlarmWeekday);
    }

    return i32Ret;
}

/**
 * @brief  Get RTC alarm time.
 * @param  [in] u8Format                Specifies the format of the returned parameters.
 *         This parameter can be one of the following values:
 *           @arg RTC_DATA_FMT_DEC:     Decimal data format
 *           @arg RTC_DATA_FMT_BCD:     BCD data format
 * @param  [out] pstcRtcAlarm           Pointer to a @ref stc_rtc_alarm_t structure
 * @retval int32_t:
 *           - LL_OK: Get RTC alarm time success
 *           - LL_ERR_INVD_PARAM: Invalid parameter
 */
int32_t RTC_GetAlarm(uint8_t u8Format, stc_rtc_alarm_t *pstcRtcAlarm)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcRtcAlarm) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_DATA_FMT(u8Format));

        /* Get RTC date and time register */
        pstcRtcAlarm->u8AlarmWeekday = READ_REG8(CM_RTC->ALMWEEK);
        pstcRtcAlarm->u8AlarmMinute  = READ_REG8(CM_RTC->ALMMIN);
        pstcRtcAlarm->u8AlarmHour    = READ_REG8(CM_RTC->ALMHOUR);

        if (RTC_HOUR_FMT_12H == READ_REG32(bCM_RTC->CR1_b.AMPM)) {
            if (RTC_HOUR_12H_PM == (pstcRtcAlarm->u8AlarmHour & RTC_HOUR_12H_PM)) {
                CLR_REG8_BIT(pstcRtcAlarm->u8AlarmHour, RTC_HOUR_12H_PM);
                pstcRtcAlarm->u8AlarmAmPm = RTC_HOUR_12H_PM;
            } else {
                pstcRtcAlarm->u8AlarmAmPm = RTC_HOUR_12H_AM;
            }
        } else {
            pstcRtcAlarm->u8AlarmAmPm = RTC_HOUR_24H;
        }

        /* Check decimal format*/
        if (RTC_DATA_FMT_DEC == u8Format) {
            pstcRtcAlarm->u8AlarmHour   = RTC_BCD2DEC(pstcRtcAlarm->u8AlarmHour);
            pstcRtcAlarm->u8AlarmMinute = RTC_BCD2DEC(pstcRtcAlarm->u8AlarmMinute);
        }
    }

    return i32Ret;
}

/**
 * @brief  Enable or disable RTC alarm.
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void RTC_AlarmCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (enNewState == ENABLE) {
        SET_REG8_BIT(CM_RTC->CR2, RTC_CR2_ALME | RTC_CR2_FLAG_MASK);
    } else {
        MODIFY_REG8(CM_RTC->CR2, (RTC_CR2_ALME | RTC_CR2_FLAG_MASK), ~RTC_CR2_ALME);
    }
}

/**
 * @brief  Enable or disable specified RTC interrupt.
 * @param  [in] u32IntType              Specifies the RTC interrupt source.
 *         This parameter can be one or any combination of the following values:
 *           @arg @ref RTC_Interrupt
 * @param  [in] enNewState                An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void RTC_IntCmd(uint32_t u32IntType, en_functional_state_t enNewState)
{
    uint32_t u32IntTemp;

    /* Check parameters */
    DDL_ASSERT(IS_RTC_INT(u32IntType));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32IntTemp = u32IntType & 0x0000FFUL;
    if (0UL != u32IntTemp) {
        if (DISABLE != enNewState) {
            SET_REG8_BIT(CM_RTC->CR2, u32IntTemp | RTC_CR2_FLAG_MASK);
        } else {
            MODIFY_REG8(CM_RTC->CR2, (u32IntTemp | RTC_CR2_FLAG_MASK), ~u32IntTemp);
        }
    }

}

/**
 * @brief  Get RTC flag status.
 * @param  [in] u32Flag                 Specifies the RTC flag type.
 *         This parameter can be one or any combination of the following values:
 *           @arg @ref RTC_Flag
 *           @arg RTC_FLAG_ALL:         All of the above
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t RTC_GetStatus(uint32_t u32Flag)
{
    uint8_t u8FlagTemp;
    en_flag_status_t enFlagSta = RESET;

    /* Check parameters */
    DDL_ASSERT(IS_RTC_GET_FLAG(u32Flag));

    u8FlagTemp = (uint8_t)(u32Flag & 0xFFU);
    if (0U != u8FlagTemp) {
        if (0U != (READ_REG8_BIT(CM_RTC->CR2, u8FlagTemp))) {
            enFlagSta = SET;
        }
    }

    return enFlagSta;
}

/**
 * @brief  Clear RTC flag.
 * @param  [in] u32Flag                 Specifies the RTC flag type.
 *         This parameter can be one or any combination of the following values:
 *           @arg @ref RTC_Flag
 *           @arg RTC_FLAG_CLR_ALL:     All of the above
 * @retval None
 */
void RTC_ClearStatus(uint32_t u32Flag)
{
    uint8_t u8FlagTemp;

    /* Check parameters */
    DDL_ASSERT(IS_RTC_CLR_FLAG(u32Flag));

    u8FlagTemp = (uint8_t)(u32Flag & 0xFFU);
    if (0U != u8FlagTemp) {
        MODIFY_REG8(CM_RTC->CR2, RTC_CR2_FLAG_MASK, ~u8FlagTemp);
    }

}

/**
 * @}
 */

#endif /* LL_RTC_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
